# Максимальная длина для username, first_name и last_name пользователя.
USER_NAMES_MAX_LENGTH = 150
# Максимальная длина для почты пользователя.
EMAIL_MAX_LENGTH = 254
# Максимальная длина названия ингредиента и рецепта.
RECIPE_INGREDIENT_NAME_MAX_LENGTH = 256
# Максимальная длина для единиц измерения.
MEASUREMENT_UNIT_MAX_LENGTH = 10
# Максимальная длина для кода короткой ссылки.
# Почему 3? Потому что я не нашел в ТЗ конкретное значение,
# в примере в документации код состоял из 3-х символов, поэтому решил взять 3.
SHORT_LINK_CODE_MAX_LENGTH = 3
# Минимально возможное количество ингредиента.
MIN_INGREDIENT_AMOUNT = 0
# Минимальное время приготовления блюда.
MIN_COOKING_TIME = 0
